# Клиент приходит в кондитерскую. Он хочет приобрести один или несколько видов продукции, а также узнать её состав.
# Реализуйте кондитерскую. У вас есть словарь, где ключ – название продукции (торт, пирожное, маффин и
# т.д.). Значение – список, который содержит состав, цену (за 100гр) и кол-во (в
# граммах).
# Предложите выбор:
# 1. Если человек хочет посмотреть описание: название – описание
# 2. Если человек хочет посмотреть цену: название – цена.
# 3. Если человек хочет посмотреть количество: название – количество.
# 4. Всю информацию.
# 5. Приступить к покупке:
# С клавиатуры вводите название торта и его кол-во. n – выход из программы.
# Посчитать цену выбранных товаров и сколько товаров осталось в изначальном
# списке
# 6. До свидания
dict1 = {
    "торт": [
        ["тыква свежая", "сахар", "слезы кондитера"],
        50,
        5
    ],
    "пироженое": [
        ["мука", "сахар", "ещё сахар"],
        12,
        10
    ],
    "маффин": [
        ["кабачок свежий", "соль", "перец"],
        23,
        12
    ],
    "т.д.": [
        ["коржик кондитерский", "сахар", "соль"],
        100,
        1
    ]
}
variant = ""
while True:
    print("1 - просмотр меню\n2 - приступить к покупке\n3 - выход")
    choice_menu = input("Введите номер дейсвия: ")
    while not choice_menu.isdigit() or int(choice_menu) < 1 or int(choice_menu) > 3:
        choice_menu = input("Введите номер действия (от 1 до 3): ")
    if int(choice_menu) == 1:
        while True:
            print("=============================================================================")
            print("1 - торт\n2 - пироженое\n3 - маффин\n4 - т.д.(французское изысканное блюдо)\n5 - назад в меню")
            choice_product = input("Введите номер интересующуго вас продукта: ")
            while not choice_menu.isdigit() or int(choice_menu) < 1 or int(choice_menu) > 5:
                choice_product = input("Введите номер интересующуго вас продукта(от 1 до 4): ")
            print("=============================================================================")
            if int(choice_product) == 1:
                variant = "торт"
            elif int(choice_product) == 2:
                variant = "пироженое"
            elif int(choice_product) == 3:
                variant = "маффин"
            elif int(choice_product) == 4:
                variant = "т.д."
            elif int(choice_product) == 5:
                break
            print("1 - состав\n2 - цена за 100г\n3 - колличество\n4 - все содержимое\n5 - назад к меню")
            choice_info = input(f"Что бы вы хотели узнать о продукте {variant}: ")
            while not choice_info.isdigit() or int(choice_info) < 1 or int(choice_info) > 4:
                choice_info = input(f"Что бы вы хотели узнать о продукте {variant}(от 1 до 5): ")
            print("=============================================================================")
            if int(choice_info) == 1:
                str1 = ", ".join(dict1[variant][0])
                print("Состав: ", str1)
                continue
            elif int(choice_info) == 2:
                print("Цена: ", dict1[variant][1])
                continue
            elif int(choice_info) == 3:
                print("Колличество: ", dict1[variant][2])
                continue
            elif int(choice_info) == 4:
                str1 = ", ".join(dict1[variant][0])
                print("Состав: ", str1, "\nЦена: ", dict1[variant][1], "\nКолличество: ", dict1[variant][2])
                continue
    elif int(choice_menu) == 2:
        print("=============================================================================")
        print("\tМеню:\nторт\nпироженое\nмаффин\nт.д.")
        print("=============================================================================")
        choice_buy = input("Что вы хотите купить?: ")
        if choice_buy in dict1:
            print("=============================================================================")
            choice_amount = input(f"Сколько продукта {choice_buy} вам нужно(по 100гр)?: ")
            while not choice_menu.isdigit():
                choice_amount = input(f"Сколько продукта {choice_buy} вам нужно(по 100гр)?: ")
            if int(choice_amount) > dict1[choice_buy][2]:
                print("=============================================================================")
                print("К сожалению столько продуктов нет в кондитерской(((")
                print("=============================================================================")
                continue
            else:
                print("=============================================================================")
                print(f"И так, всего вы потратите {dict1[choice_buy][1] * int(choice_amount)} р")
                dict1[choice_buy][2] = dict1[choice_buy][2] - int(choice_amount)
                print(f"Осталось всего {dict1[choice_buy][2]} продуктов под названием {choice_buy}")
                print("=============================================================================")
                continue
        else:
            print("=============================================================================")
            print("такого продукта нет нет(((")
            print("=============================================================================")
            continue
    elif int(choice_menu) == 3:
        break
